{"data":[{"id":"ca3a2f5f-5ad5-4061-8c76-3a34bb16a46e","text":"Talent Acquisition Specialist","state":"draft","distributionChannels":null,"user":"a36afa34-7f69-44ee-ba2d-f92d2fbbdecd","owner":"a36afa34-7f69-44ee-ba2d-f92d2fbbdecd","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Remote","team":"People Operations"},"tags":[],"content":{"description":"We have undergone a lot of growth in the past 12 months and have even more exciting plans ahead of us! \n\nWe are looking to add a data-driven, people-focused, and curious Talent Acquisition Specialist to our team to help us grow at scale. Your role will be to work closely with our Hiring Managers to understand their needs and the role requirements and grow our unique and diverse team. At times you will also be a key player in supporting other Talent Acquisition Specialist team members with additional projects, offer letters, pre-screens and scheduling. This role will report to our Technical Talent Acquisition Manager on our People Operations team.\n\nYou will play a critical role in shaping the culture of our organization, bringing in top talent who live our values, and bringing new perspectives and ideas to Humi. You'll be an ambassador of our culture!\n\nWho are we?\n\nHumi’s mission is to help organizations throughout Canada foster their greatest asset – their employees. Starting with a powerful yet intuitive HR, payroll, benefits, and insurance platform, Humi has established a leadership position as the only company addressing all of these needs in one place. With a potential reach spanning every business in Canada, and a platform that touches every employee at every business that uses it, Humi is reimagining the future of work.\n\nHumi is backed by the same group who funded Slack, Carta, and more (Tribe Capital), the top value-based U.S. accelerator (Y-Combinator), as well as several of the world’s leading angel investors.\n\nWe’re hiring across Canada and are open to applicants who prefer to work remotely!\n\nWe are committed to building an inclusive and diverse workforce, representative of the communities we serve and beyond. We encourage and are pleased to consider applications from Indigenous peoples, racialized persons/persons of colour, women, persons with disabilities, LGBTQ+ persons, and others who contribute towards promoting innovative ideas and solutions. \n\nWhat are we looking for in a Talent Acquisition Specialist?\n\nAs the Talent Acquisition Specialist, you will be the team member that works collaboratively to run full-lifecycle recruitment activities for all of our roles, as well as plan initiatives to build an outstanding candidate experience and employer branding activities. You’ll play a pivotal role, positively impacting how we attract and hire exceptional people who are the heart and soul of the entities we support.\n\nYour natural ability to connect with others is essential as you’ll work with various people, from candidates to internal teams. Your ability to work quickly, efficiently and with care will play a key role in building our world-class People team at Humi. Having a “can-do” attitude and stepping up to the plate is what we are all about!\n\nThis mid entry-level role is embedded in Humi's growing People Operations team, on the Talent Acquisition side. We know that to deliver on our culture, to care about our Humigos, and to continue to make Humi a great place to work - we need a candidate-focused team member in this role.\n\nWhat will you be doing as a Talent Acquisition Specialist?\n\nIn this role, you'll manage our ATS for all roles across the departments (Client Experience, Sales, Marketing, Insurance, Finance, Operations, Engineering and People), help manage the end-to-end general recruitment process for the team and use your negotiation skills to help us hire bright and talented people who are looking to make an impact by improving the lives of Canadian SMBs. Ultimately, you will build a strong talent pipeline and help hire and retain skilled employees for Humi's growth.\n\nYou will also get the chance to work on internal People Operations projects and other initiatives within the organization that interests you. \nYour time will be organized (approximately):\n\n\nIn your first 30 days, you will:\n\n\nIn your first 60 days, you will:\n\n\nIn your first 90 days, you will: \n\n\nWhat are we looking for in a Talent Acquisition Specialist?\n\nTo be successful in this role, you must:\n\n\nYou might be the person we’re looking for if you:\n\nBonus points if you:\n\n \n","descriptionHtml":"<div>We have undergone a lot of growth in the past 12 months and have even more exciting plans ahead of us!&nbsp;</div><div><br></div><div>We are looking to add a data-driven, people-focused, and curious Talent Acquisition Specialist to our team to help us grow at scale. Your role will be to work closely with our Hiring Managers to understand their needs and the role requirements and grow our unique and diverse team. At times you will also be a key player in supporting other Talent Acquisition Specialist team members with additional projects, offer letters, pre-screens and scheduling. This role will report to our Technical Talent Acquisition Manager on our People Operations team.</div><div><br></div><div>You will play a critical role in shaping the culture of our organization, bringing in top talent who live our values, and bringing new perspectives and ideas to Humi. You'll be an ambassador of our culture!</div><div><br></div><div><b>Who are we?</b></div><div><br></div><div>Humi’s mission is to help organizations throughout Canada foster their greatest asset – their employees. Starting with a powerful yet intuitive HR, payroll, benefits, and insurance platform, Humi has established a leadership position as the only company addressing all of these needs in one place. With a potential reach spanning every business in Canada, and a platform that touches every employee at every business that uses it, Humi is reimagining the future of work.</div><div><br></div><div>Humi is backed by the same group who funded Slack, Carta, and more (Tribe Capital), the top value-based U.S. accelerator (Y-Combinator), as well as several of the world’s leading angel investors.</div><div><br></div><div>We’re hiring across Canada and are open to applicants who prefer to work remotely!</div><div><br></div><div>We are committed to building an inclusive and diverse workforce, representative of the communities we serve and beyond. We encourage and are pleased to consider applications from Indigenous peoples, racialized persons/persons of colour, women, persons with disabilities, LGBTQ+ persons, and others who contribute towards promoting innovative ideas and solutions.&nbsp;</div><div><br></div><div><b>What are we looking for in a Talent Acquisition Specialist?</b></div><div><br></div><div>As the Talent Acquisition Specialist, you will be the team member that works collaboratively to run full-lifecycle recruitment activities for all of our roles, as well as plan initiatives to build an outstanding candidate experience and employer branding activities. You’ll play a pivotal role, positively impacting how we attract and hire exceptional people who are the heart and soul of the entities we support.</div><div><br></div><div>Your natural ability to connect with others is essential as you’ll work with various people, from candidates to internal teams. Your ability to work quickly, efficiently and with care will play a key role in building our world-class People team at Humi. Having a “can-do” attitude and stepping up to the plate is what we are all about!</div><div><br></div><div>This mid entry-level role is embedded in Humi's growing People Operations team, on the Talent Acquisition side. We know that to deliver on our culture, to care about our Humigos, and to continue to make Humi a great place to work - we need a candidate-focused team member in this role.</div><div><br></div><div><b>What will you be doing as a Talent Acquisition Specialist?</b></div><div><br></div><div>In this role, you'll manage our ATS for all roles across the departments (Client Experience, Sales, Marketing, Insurance, Finance, Operations, Engineering and People), help manage the end-to-end general recruitment process for the team and use your negotiation skills to help us hire bright and talented people who are looking to make an impact by improving the lives of Canadian SMBs. Ultimately, you will build a strong talent pipeline and help hire and retain skilled employees for Humi's growth.</div><div><br></div><div>You will also get the chance to work on internal People Operations projects and other initiatives within the organization that interests you.&nbsp;</div><div>Your time will be organized (approximately):</div><div><br></div><div><br></div><div><b>In your first 30 days, you will:</b></div><div><br></div><div><br></div><div><b>In your first 60 days, you will:</b></div><div><br></div><div><br></div><div><b>In your first 90 days, you will:&nbsp;</b></div><div><br></div><div><br></div><div><b>What are we looking for in a Talent Acquisition Specialist?</b></div><div><br></div><div><b>To be successful in this role, you must:</b></div><div><br></div><div><br></div><div><b>You might be the person we’re looking for if you:</b></div><div><br></div><div><b>Bonus points if you:</b></div><div><br></div><div>&nbsp;</div>","lists":[{"content":"<li>Our team supports every department that helps create solutions that build the future of work. We are a team that understands you perform best in an environment that cares about its employees</li><li>Be part of high performing team of critical thinkers that thrive on problem-solving</li><li>Participate in shaping the future of work, and being rewarded with meaningful equity</li><li>Access leadership and growth opportunities as the company rapidly scales</li><li>Maintain work-life balance with the flexibility to take mid-day appointments and flex hours</li><li>Participate in hard-skill development workshops as well as lunch and learns</li><li>Opportunity to work fully remote across Canada if you choose to</li>","text":"Why join the Humi Team?"},{"content":"<li>50% interviewing and interacting with candidates to find the best talent for Humi</li><li>20% recruitment administrative work to help TA team members with pre-screens, offers, initiating background checks &amp; references as well as creating job descriptions</li><li>10% working with hiring managers to intake roles, update on candidate pipeline and give important feedback</li><li>10% learning from and shadowing other members of the recruiting team to identify ways to improve the sourcing and recruiting process and we grow</li><li>10% relationship management and networking with talent partners</li>","text":"Your time will be organized (approximately):"},{"content":"<li>Goal setting session with the Technical Talent Acquisition Manager</li><li>Training to HR tools: Humi, Notion, Peakon, Fellow, etc.</li><li>Walkthrough current processes and procedures</li><li>Conduct candidate screening, including resume screening and phone screen</li><li>Receive platform training on our ATS module</li><li>Meet with all Hiring Managers for our General departments (Client Experience, Sales, Marketing, Insurance, Finance, Operations, Engineering and People).</li>","text":"30 days"},{"content":"<li>Own and execute all stages of the recruitment life cycle: partnering with our hiring managers to deeply understand their requirements, crafting job descriptions, attracting ideal Humigo candidates, drafting offers of employment for review, completing reference checks, and negotiating and presenting offers to successful candidates</li><li>Coordinate and drive the interviews for our teams needs - from intern to Management-level roles, in collaboration with our Senior Talent Acquisition Specialist</li><li>Manage the active candidate pipeline—you’ll do your own coordinating and handle all communications with all candidates directly within your owned roles</li><li>Support the creation of all policy, documentation, and internal projects</li><li>Identify 1 special project that will help enhance the candidate experience at Humi</li>","text":"60 days"},{"content":"<li>Be an expert on the systems and platforms used at Humi</li><li>Proactively source and prospect candidates through available tools (using our ATS, as well as LinkedIn Recruiter, Hired, etc.) to develop qualified candidate leads for Humi</li><li>Demonstrate exceptional knowledge of the Humi culture, and embody that in-person and when working online</li><li>Present your overall findings of recruiting processes that are working, areas that can be improved, and make at least one creative recommendation for an existing initiative</li><li>Participate in your first quarterly performance review</li><li>In your first year, you will:&nbsp;</li><li>Demonstrate strong industry knowledge in recruiting and onboarding best practices by creating creative experiences for Humigos</li><li>Demonstrate excellent written and verbal communication skills with colleagues</li><li>Have an affinity for finding a problem and recommending a creative solution</li><li>Participate in your first annual review</li>","text":"90 Days"},{"content":"<li>Have a natural ability to communicate with others and be a people person! As an empathic team player who cares about building genuine relationships, you find it easy to make a phone call or network in a crowd (virtual or in-person) and strike up a meaningful conversation with a potential team member—but can equally step up when you have to write a thoughtful rejection email</li><li>Have previous Recruitment/Talent Acquisition experience (ideally 2-3 years, bonus points if it's in the technology sector)</li><li>Be proactive in your communication, to both candidates, and hiring managers. You know how to set expectations and you have a track-record for delivering results</li><li>Be hyper-organized and almost never let the little things slip by you. You can navigate your calendar in your sleep, you live by checklists and most importantly - you never forget a stand-out candidate’s name</li><li>Advocate for yourself and your teammates; you've never said, “that’s not my job” when asked for help by others</li><li>Be driven to provide nothing less than an amazing candidate experience—you have proven this in past roles by going above and beyond to make sure candidates leave happy, regardless of the final outcome</li><li>Have a demonstrated passion for thoughtfully building holistically diverse and inclusive teams using a strategic growth mindset</li><li>Be driven to connect the right people to the right roles at the right company - which may be another role at another company</li><li>Be comfortable with poking holes in existing recruitment processes to help evolve the candidate experience, with the ability to accept feedback</li>","text":"Must Have's"},{"content":"<li>Improve our general recruitment process, from sourcing through to hiring, by identifying opportunities to make an even more positive and candidate-centric experience</li><li>Maintain and evolve our interview processes, working with our hiring managers to deliver a welcoming, consistent, and equitable candidate experience for every candidate</li><li>Work with our hiring managers to develop inclusive job descriptions (impact statements) that will speak to our target audiences of job seekers</li><li>Conduct resume screening and phone interviews, maintain applicant records, provide timely communication and feedback to candidates</li><li>Coordinate with candidates, hiring managers, and interview peers to schedule interviews and discussions</li><li>Have experience and a passion for building a diverse recruiting pipeline</li><li>Collaborate with our People team to divide and conquer the recruiting workload and identify opportunities for process improvements</li><li>Work with the marketing team to build our employer brand, improve our career’s page content, and build our Glassdoor presence</li><li>Work cross-functionally with all teams to meet ambitious department growth targets</li><li>Be curious and have a scrappy \"roll up your sleeves\" approach to work</li>","text":"Might be this person if"},{"content":"<li>Have worked in a scaling start-up or growing small-business environment</li>","text":"Bonus"}],"closing":"","closingHtml":""},"followers":["a36afa34-7f69-44ee-ba2d-f92d2fbbdecd"],"reqCode":null,"requisitionCodes":[],"urls":null,"confidentiality":"non-confidential","createdAt":1649807508798,"updatedAt":1649807508798},{"id":"ef2d577a-00cb-4917-a52a-a7ae07386656","text":"VP, Product - Remote","state":"internal","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Product Management"},"tags":[],"content":{"description":"We're a scaling technology company that is looking for a product visionary to build out the strategy for the next stage of our growth. Over the last five years, Humi has built a very special foundation. We are Canada’s leading and fastest growing people technology platform. Our platform touches tens of thousands of lives every day, moves millions of dollars, and supports thousands of businesses in achieving their goals. We are at an inflection point of both growth and product maturity, and are searching for a confident, passionate, and ambitious leader who can build an innovative and impactful vision on top of this unique foundation.\n\nThe opportunities to extend into the depths of the employer and employee ecosystem, both locally and globally, are almost endless. Few platforms will offer this type of reach and impact. Do you want to help businesses recruit with less bias, help employees engage with their peers in more meaningful ways, or unlock and redefine business and employees access to financial services? In this role, you will have the autonomy and platform to decide how we can best leverage what we’ve built, to build an even more meaningful future. We're not just here to enable businesses to manage employees; we're here to educate businesses on how to invest and cultivate a vibrant and successful employe base. In order to do that, we need a VP Product who becomes intimately familiar with the problems our customers have at multiple stages of growth and how we can support, educate and lead them through that journey.\n\nThis leadership position will lead both Product Managers, and User Experience (UX) professionals. Leading a mid-sized team of over 12 people, you will drive the product vision, strategy and roadmap. You’ll collaborate with a cross-functional team (including Engineering, Client Experience (CX) and our Sales and Marketing teams) to create a world-class product.\n\nThis is a remote-first position; Humi hires across Canada.\n\nWhat are we looking for in a VP, Product?\nYou sweat the small stuff because you know that overlooking the details is dangerous. Your attention to detail leads to well-thought-through, elegantly designed, and beautifully executed solutions, and you're able to instill that ethos in the wider team. You continually challenge the organization to reach higher levels of quality without sacrificing efficiencies and help the team define when good enough really is good enough.\n\n","descriptionHtml":"<div>We're a scaling technology company that is looking for a product visionary to build out the strategy for the next stage of our growth. Over the last five years, Humi has built a very special foundation. We are Canada’s leading and fastest growing people technology platform. Our platform touches tens of thousands of lives every day, moves millions of dollars, and supports thousands of businesses in achieving their goals. We are at an inflection point of both growth and product maturity, and are searching for a confident, passionate, and ambitious leader who can build an innovative and impactful vision on top of this unique foundation.</div><div><br></div><div>The opportunities to extend into the depths of the employer and employee ecosystem, both locally and globally, are almost endless. Few platforms will offer this type of reach and impact. Do you want to help businesses recruit with less bias, help employees engage with their peers in more meaningful ways, or unlock and redefine business and employees access to financial services? In this role, you will have the autonomy and platform to decide how we can best leverage what we’ve built, to build an even more meaningful future. We're not just here to enable businesses to manage employees; we're here to educate businesses on how to invest and cultivate a vibrant and successful employe base. In order to do that, we need a VP Product who becomes intimately familiar with the problems our customers have at multiple stages of growth and how we can support, educate and lead them through that journey.</div><div><br></div><div>This leadership position will lead both Product Managers, and User Experience (UX) professionals. Leading a mid-sized team of over 12 people,&nbsp;you will drive the product vision, strategy and roadmap. You’ll collaborate with a cross-functional team (including Engineering, Client Experience (CX)&nbsp;and our Sales and Marketing teams) to create a world-class product.</div><div><br></div><div>This is a remote-first position; Humi hires across Canada.</div><div><br></div><div><b><span style=\"font-size: 24px\">What are we looking for in a VP, Product?</span></b></div><div>You sweat the small stuff because you know that overlooking&nbsp;the details is dangerous. Your attention to detail leads to well-thought-through, elegantly designed, and beautifully executed solutions, and you're able to instill&nbsp;that ethos in the wider team. You continually challenge the organization to reach higher levels of quality without sacrificing efficiencies and help the team define when good enough really is good enough.</div><div><br></div>","lists":[{"content":"<li>Immediately assume significant responsibility driving product roadmap, direction, and strategy</li><li>Inspire our teams and clients, building the storyline that drives Humi's impact through product</li><li>Serve on the leadership team which includes the Chief Executive Officer, Chief Commercial Officer, VP Engineering, VP Operations and Director of People Operations</li><li>Identify our most critical product KPIs and methodically prioritize products and features to improve them</li><li>Prioritize resources and projects to maximize our growth and create high-quality products</li><li>Build alignment and work collaboratively with cross-functional partners (Engineering, Marketing, Client Experience, and Operations) to deliver intuitive product solutions</li><li>Build an environment that measures performance excellence by setting the definitions of success for our product, setting cascading goals for each squad, and measuring the impact of product releases</li><li>Work to create an intimate understanding of the market in order to identify growth areas and strategies for the product roadmap</li><li>Empower the Product Management department by defining the structure, strategy, and PM practices that are needed to enable our people to approach complex and ambiguous situations with clarity and focus</li>","text":"How Will I Make An Impact?"},{"content":"<li>Proven visionary who has experience creating a product strategy and roadmap from scratch, and scaling in a start-up environment (leading to significant scale)</li><li>Proven track record in modern B2B product management</li><li>Extensive experience leading product teams, inspiring multi-disciplinary squads to build and drive to execution</li><li>Passionate and obsessive about design, content, and brand</li><li>Experience working in fast-growing startups</li><li>An entrepreneurial drive and demonstrated ability to achieve stretch goals in an innovative and fast-paced environment, while building extensible and scalable solutions</li><li>Strong user empathy and an excellent understanding of best-in-class user experiences</li><li>World-class product vision, strategy, planning, development, and execution</li><li>Strong analytical, data, and troubleshooting skills to bring a data-driven approach to product management</li>","text":"Must haves:"},{"content":"<li>You have a passion for the HR tech space</li><li>Public speaking skills and a willingness to share your thinking within the Product community</li><li>Prior experience working in a venture-backed company</li>","text":"Nice to haves:"},{"content":"<li><b>Insight Driven </b></li><div>You use data to predict innovative ways that the product can address our current customer needs while thinking ahead of the market. You use data insights to ensure that you deeply understand the markets’ problems and define the right priorities for both the short and long-term.</div><li><b>Product Story-telling</b>&nbsp;</li><div>Set strategy and influence others to think big about where we are headed and how we will get there. You paint the bigger picture by building a compelling story and sharing that narrative. You can create/clarify strategy within very ambiguous areas with no guidance, and can clearly explain to stakeholders, why we are pursuing one set of priorities versus another.</div><li><b>Execution</b>&nbsp;</li><div>You know&nbsp;<i>what to ship</i>, and&nbsp;<i>when</i>. You have a stubborn focus on understanding, refining, and articulating the problem (or opportunity) the team is solving. When done well, the whole team is oriented around the problem and able to explain it themselves.&nbsp;<i>Think big, start small</i>. You are most directly responsible for ensuring the Product squads constantly fight to scope smaller to learn faster, balancing an ambition to think expansively about the opportunity.</div><li><b>Performance </b></li><div>You will work across the business to determine: how new &amp; existing customers find out about it, what the monetization approach is, how Sales will sell and how Client Experience will support it.</div><li><b>Driving outcomes</b>&nbsp;</li><div>Shipping is our heartbeat. There can be no changed outcome and limited learning without shipping. Great product teams demonstrate a consistent shipping cadence. But it’s not just the speed at which we ship, we very much care about the quality of the product. You are able to inspire and encourage multiple teams to push for a higher bar for quality across the broader system.</div><li><b>Leadership behaviours </b></li><div>VP, Product inspires and motivates the team to work towards a clear, compelling vision. You communicate clearly, concisely, and assertively. You build confidence through being opinionated and persuasive, and in doing so - can build engaged, high-performing collaborative, and inclusive teams.</div>","text":"What We're Expecting from You"}],"closing":"The Hiring Process\nWe move quickly, but do our due diligence. We will move the process forward in a way that makes sense and works for the goals of Humi's hiring plans, and the availability of your application. Only qualified candidates will be contacted for an interview.\n\n1. Application. Once you've confirmed your interest and submitted your application, we'll be in touch within 3 business days\n\n2. Story Call with the CEO. We want to know what lights you up, the challenges you've faced in your career, your approach to leading a Product organization, and what you're looking for in your next role and team.\n\n3. Connect with the Team. We want you to get to know us. You'll meet with leaders within the SLT, UX, Engineering and of course - the Product team members in up to 3 different conversations. If you feel like someone has been missed in the process - let us know! We want you to know the team you'll be leading\n\n4. Final Decision-making. Once we've made an offer, you'll have the opportunity to ask questions about the nitty-gritty details. All of our offers are conditional on completing references and a background check.\n\n\nIf you require assistance throughout the interview process, please email talent@humi.ca.\n","closingHtml":"<div><b><span style=\"font-size: 18px\">The Hiring Process</span></b></div><div>We move quickly, but do our due diligence. We will move the process forward in a way that makes sense and works for the goals of Humi's hiring plans, and the availability of your application. Only qualified candidates will be contacted for an interview.</div><div><br></div><div>1. <b>Application</b>.&nbsp;Once you've confirmed your interest and submitted your application, we'll be in touch within 3 business days</div><div><br></div><div>2. <b>Story Call with the CEO.</b>&nbsp;We want to know what lights you up, the challenges you've faced in your career, your approach to leading a Product organization, and what you're looking for in your next role and team.</div><div><br></div><div>3. <b>Connect with the Team.</b>&nbsp;We want you to get to know us. You'll meet with leaders within the SLT, UX, Engineering and of course - the Product team members in up to 3 different conversations. If you feel like someone has been missed in the process - let us know! We want you to know the team&nbsp;you'll be leading</div><div><br></div><div>4. <b>Final Decision-making.</b>&nbsp;Once we've made an offer, you'll have the opportunity to ask questions about the nitty-gritty details. All of our offers are conditional on completing references and a background check.</div><div><br></div><div><br></div><div>If you require assistance throughout the interview process, please email talent@humi.ca.</div>"},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3"],"reqCode":"","requisitionCodes":[],"urls":{"list":"https://jobs.lever.co/humi-2","show":"https://jobs.lever.co/humi-2/ef2d577a-00cb-4917-a52a-a7ae07386656","apply":"https://jobs.lever.co/humi-2/ef2d577a-00cb-4917-a52a-a7ae07386656/apply"},"confidentiality":"non-confidential","createdAt":1649366722023,"updatedAt":1650371215532},{"id":"16f6a854-83d3-4981-813d-b6919a44ecfb","text":"Senior Product Manager - Remote","state":"closed","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Product Management"},"tags":[],"content":{"description":"Are you an experienced Product Manager who's owned the development of SaaS products looking for an opportunity to lead a team within a rapidly growing startup where you will be given autonomy to own your roadmap?\n\nAs a Senior Product Manager here at Humi, you will make an immediate impact by building products to support our business’ rapid growth. You will guide a cross-functional squad through the development of complex features, working with others to make tradeoff decisions, prioritize the right things, and ensure we are shipping extremely high-quality products. You will work closely with a cross-functional team of Engineers, UX, and Marketers as well as customers to define, build, and launch mission-critical initiatives.\n\nYou should be a team player, natural leader, and consistent influencer in regards to the \"why\" and the \"what\" of your area of focus. You will constantly strive for domain expertise by immersing yourself in the HR space.\n\nWhat you will be doing as a Senior Product Manager?\nThis role will be hyper-focused on the HR aspect of our product. Humi is an all-in-one solution product with a hub and spoke modular product. The role will immediately manage a squad focused on recruiting, but will also support other areas of focus in the HR product. We're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.\n\nWe're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.\n\n","descriptionHtml":"<div>Are you an experienced Product Manager who's owned the development of SaaS products looking for an opportunity to lead a team within a rapidly growing startup where you will be given autonomy to own your roadmap?</div><div><br></div><div>As a Senior Product Manager here at Humi, you will&nbsp;make an immediate impact by building products to support our business’ rapid growth. You will guide a cross-functional squad through the development of complex features, working with others to make tradeoff decisions, prioritize the right things, and ensure we are shipping extremely high-quality products. You will work closely with a cross-functional team of Engineers, UX, and Marketers as well as customers to define, build, and launch mission-critical initiatives.</div><div><br></div><div>You should be a team player, natural leader, and consistent influencer in regards to the \"why\" and the \"what\" of your area of focus. You will constantly strive for domain expertise by immersing yourself in the HR space.</div><div><br></div><div><b style=\"font-size: 24px\">What you will be doing as a Senior Product Manager?</b></div><div>This role will be hyper-focused on the HR aspect of our product. Humi is an all-in-one solution product with a hub and spoke modular product. The role will immediately manage a squad focused on recruiting, but will also support&nbsp;other areas of focus in the HR product. We're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.</div><div><br></div><div>We're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.</div><div><br></div>","lists":[{"content":"<li>You will be responsible for product ownership, including backlog grooming, triage and prioritization, and cross-functional coordination</li><li>You will be defining the scope of development for new product features and ongoing feature enhancements including all management of backlog and development activities</li><li>You will write and prioritize epics, user stories, and define acceptance criteria</li><li>You will establish and maintain a high level of credibility with internal and external stakeholders</li><li>You will leverage your analytical ability to back your decisions with data</li><li>You will effectively use data and analytics layered against high-quality user research to inform the direction of the product line</li><li>You will be responsible for tracking progress, assessing risks, coordinating delivery, and actively communicate contingency and mitigation plans for the team</li><li>You will run various ad-hoc research and business analyses to assess opportunities and risks</li>","text":""},{"content":"<li>Onboard and integrate into the Humi Product team</li><li>Become acquainted with your product area, the product goals, and those you will work closely with</li><li>Independently start to study and learn the Humi product suite</li><li>Independently start to build a knowledge base and domain expertise within the payroll domain</li><li>Talk with customers to build knowledge and empathy toward our users</li>","text":"In the first 30 days, you will:"},{"content":"<li>Immerse yourself in our product development and build process</li><li>Work cross-functionally and with product leadership to organize and prioritize your high-level roadmap and backlog</li><li>Start working closely with your development and design team</li><li>Continue to learn the Humi product suite</li><li>Take over all in-flight and planned initiatives</li>","text":"In the first 60 days, you will:"},{"content":"<li>Fully support a product area, working with product leadership to complete quarterly planning and set OKRs</li><li>Fully own roadmap planning for the swim lanes within your product squad</li><li>Ship features that deliver high business impact</li><li>Be fully embedded into and owning a development team</li><li>Monitor and measure the success of your initiatives against company goals</li><li>Continuously improve your team’s practice and processes</li>","text":"In the first 90 days, you will:"},{"content":"<li>Work with product leadership to discover new product opportunities for your backlog</li><li>Develop a repeatable model for delivering upon your roadmap initiatives</li><li>Work with other product managers to measure and refine your roadmap, backlog, and processes to make improvements over time</li><li>Constantly re-evaluate your roadmap’s alignment with the strategic goals of the business, adjusting where necessary</li><li>Deliver on your roadmap priorities and promises</li><li>Ensure your team has an incredible record of building impactful products in a timely and elegant fashion</li><li>Have worked cross-functionally to scale your team to meet the growing needs of our business and our users</li><li>Ship product that directly supports the success of our company objectives</li>","text":"In the first year you will:"},{"content":"<li>4+ years of software Product Management experience</li><li>Sophisticated understanding of the digital finance space</li><li>Financial and accounting math knowledge</li><li>Ability to influence others through leadership and strong communications skills</li><li>Ability to keep up in a fast-paced and pivot in a dynamic environment</li><li>Ability to analyze data as well as to conduct research through various discussions with customers and teammates</li><li>Ability to create wireframes and user flows to articulate ideas to product designers</li><li>Detail-oriented with a high bar for quality when writing user stories, reviewing designs, brainstorming technical approaches, and testing a feature before it is released</li><li>Be humble, willing to learn, and do whatever is needed to help your team members to accomplish the team goals</li><li>Experience using agile development methodologies with globally distributed teams</li><li>Excellent verbal and written communication skills</li><li>You must be a world-class individual contributor and team player to thrive at Humi</li><li>Completed Bachelor of Science Degree in Computer Science, Information Systems, or Business Administration</li>","text":"What are we looking for in a Senior Product Manager?"},{"content":"<li>You have a passion for the HR tech, recruiting, or fintech space</li><li>You've worked in a cross-functional team previously where you and your squad took ownership of the success of an area of focus</li>","text":"Nice to haves:"}],"closing":"","closingHtml":""},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3"],"reqCode":"","requisitionCodes":[],"urls":null,"confidentiality":"non-confidential","createdAt":1649366191401,"updatedAt":1650371230270},{"id":"60f03a1a-400d-4ac1-ac34-37819dee18a6","text":"Product Manager - Remote","state":"closed","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Product Management"},"tags":[],"content":{"description":"Over the last five years, Humi has built a very special foundation. We are Canada’s leading and fastest-growing people technology platform. Our platform touches tens of thousands of lives every day, moves millions of dollars, and supports thousands of businesses in achieving their goals. \n\nThe opportunities to extend into the depths of the employer and employee ecosystem, both locally and globally, are almost endless. Few platforms will offer this type of reach and impact. \n\nAs a Product Manager at Humi, you will come into a high trust environment, where you will have the autonomy to own your piece of the roadmap and will guide a cross-functional squad through the development of complex features, working with others to make tradeoff decisions, prioritize the right things, and ensure we are shipping extremely high-quality products. You will work closely with a cross-functional team of Engineers, UX, and Marketers as well as customers to define, build, and launch mission-critical initiatives.\nYou should be a team player, natural leader, and consistent influencer in regards to the \"why\" and the \"what\" of your area of focus. You will constantly strive for domain expertise by immersing yourself in the HR space.\n\nWhat will you be doing as a Product Manager?\nThis role will be hyper-focused on the HR aspect of our product, which part will be determined based on your interest and where the interviewing team feels your skills can be best leveraged.\n\nHumi is an all-in-one solution product with a hub and spoke modular product. The role will immediately manage a squad that focuses on an area of the HR product. We're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.\n\nWe're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.\n","descriptionHtml":"<div>Over the last five years, Humi has built a very special foundation. We are Canada’s leading and fastest-growing people technology platform. Our platform touches tens of thousands of lives every day, moves millions of dollars, and supports thousands of businesses in achieving their goals.&nbsp;</div><div><br></div><div>The opportunities to extend into the depths of the employer and employee ecosystem, both locally and globally, are almost endless. Few platforms will offer this type of reach and impact.&nbsp;</div><div><br></div><div>As a Product Manager at Humi, you will come into a high trust environment, where you will have the autonomy to own your piece of the roadmap and will guide a cross-functional squad through the development of complex features, working with others to make tradeoff decisions, prioritize the right things, and ensure we are shipping extremely high-quality products. You will work closely with a cross-functional team of Engineers, UX, and Marketers as well as customers to define, build, and launch mission-critical initiatives.</div><div>You should be a team player, natural leader, and consistent influencer in regards to the \"why\" and the \"what\" of your area of focus. You will constantly strive for domain expertise by immersing yourself in the HR space.</div><div><br></div><div><b><span style=\"font-size: 24px\">What will you be doing as a Product Manager?</span></b></div><div>This role will be hyper-focused on the HR aspect of our product, which part will be determined based on your interest and where the interviewing team feels your skills can be best leveraged.</div><div><br></div><div>Humi is an all-in-one solution product with a hub and spoke modular product. The role will immediately manage a squad that focuses on an area of the HR product. We're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.</div><div><br></div><div>We're looking for someone who has a strong interest in building tools that help growing companies get the most out of their people, and tools that enable employees to get the most out of their companies.</div>","lists":[{"content":"<li>You will be responsible for product ownership, including backlog grooming, triage and prioritization, and cross-functional coordination</li><li>You will be defining the scope of development for new product features and ongoing feature enhancements including all management of backlog and development activities</li><li>You will write and prioritize epics, user stories, and define acceptance criteria</li><li>You will establish and maintain a high level of credibility with internal and external stakeholders</li><li>You will leverage your analytical ability to back your decisions with data</li><li>You will effectively use data and analytics layered against high-quality user research to inform the direction of the product line</li><li>You will be responsible for tracking progress, assessing risks, coordinating delivery, and actively communicate contingency and mitigation plans for the team</li><li>You will run various ad-hoc research and business analyses to assess opportunities and risks</li>","text":""},{"content":"<li>Onboard and integrate into the Humi Product team</li><li>Become acquainted with your product area, the product goals, and those you will work closely with</li><li>Independently start to study and learn the Humi product suite</li><li>Independently start to build a knowledge base and domain expertise within the payroll domain</li><li>Talk with customers to build knowledge and empathy toward our users</li>","text":"In the first 30 days, you will:"},{"content":"<li>Immerse yourself in our product development and build process</li><li>Work cross-functionally and with product leadership to organize and prioritize your high-level roadmap and backlog</li><li>Start working closely with your development and design team</li><li>Continue to learn the Humi product suite</li><li>Take over all in-flight and planned initiatives</li>","text":"In the first 60 days, you will:"},{"content":"<li>Fully support a product area, working with product leadership to complete quarterly planning and set OKRs</li><li>Fully own roadmap planning for the swim lanes within your product squad</li><li>Ship features that deliver high business impact</li><li>Be fully embedded into and owning a development team</li><li>Monitor and measure the success of your initiatives against company goals</li><li>Continuously improve your team’s practice and processes</li>","text":"In the first 90 days, you will:"},{"content":"<li>Work with product leadership to discover new product opportunities for your backlog</li><li>Develop a repeatable model for delivering upon your roadmap initiatives</li><li>Work with other product managers to measure and refine your roadmap, backlog, and processes to make improvements over time</li><li>Constantly re-evaluate your roadmap’s alignment with the strategic goals of the business, adjusting where necessary</li><li>Deliver on your roadmap priorities and promises</li><li>Ensure your team has an incredible record of building impactful products in a timely and elegant fashion</li><li>Have worked cross-functionally to scale your team to meet the growing needs of our business and our users</li><li>Ship product that directly supports the success of our company objectives</li>","text":"In the first year you will:"},{"content":"<li>2+ years of SaaS Product Management experience</li><li>Ability to influence others through leadership and strong communications skills</li><li>Ability to keep up in a fast-paced and pivot in a dynamic environment</li><li>Ability to analyze data as well as to conduct research through various discussions with customers and teammates</li><li>Ability to create wireframes and user flows to articulate ideas to product designers</li><li>Detail-oriented with a high bar for quality when writing user stories, reviewing designs, brainstorming technical approaches, and testing a feature before it is released</li><li>Be humble, willing to learn, and do whatever is needed to help your team members to accomplish the team goals</li><li>Experience using agile development methodologies with globally distributed teams</li><li>Excellent verbal and written communication skills</li><li>You must be a world-class individual contributor and team player to thrive at Humi</li>","text":"What are we looking for in a Product Manager?"},{"content":"<li>You have a passion for the HR tech, recruiting, or fintech space</li><li>You've worked in a cross-functional team previously where you and your squad took ownership of the success of an area of focus</li>","text":"Nice to haves:"}],"closing":"","closingHtml":""},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3"],"reqCode":"","requisitionCodes":[],"urls":null,"confidentiality":"non-confidential","createdAt":1649366066660,"updatedAt":1650371205898},{"id":"4dfc2029-053e-4559-a7d3-b3eee40348cf","text":"Product Designer - Remote","state":"published","distributionChannels":["public"],"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"User Experience (UX)"},"tags":[],"content":{"description":"Are you ready to make a change? This year has given us all the opportunity to reevaluate how we’re growing our careers and if we’re having the impact we want on the world while doing so.\n\nThis Intermediate role sits at the heart of both those missions. Our UX team is just getting started on growing and we are looking for strong team members who have a passion for purposeful work, thinking big, and teamwork. The opportunities for impact here are endless as we build out both the UX practice and team in service of amazing experiences for our customers. \n\nWe're embedded on product teams so that we can be involved with projects from the get-go and work really closely with other disciplines at every stage of the process. Designers are an integral part of evolving and defining how Humi makes the world better for employers and employees. \n\nWhat will you be doing as a Product Designer?\nYou’ll work closely with your product and engineering team members to ensure we’re solving the right problems and designing elegant solutions through an iterative, data-informed process.  As a team member, you’ll contribute to creating the conditions for world-class work to be delivered every day. \n","descriptionHtml":"<div>Are you ready to make a change? This year has given us all the opportunity to reevaluate how we’re growing our careers and if we’re having the impact we want on the world while doing so.</div><div><br></div><div>This Intermediate role sits at the heart of both those missions. Our UX team is just getting started on growing and we are looking for strong team members who have a passion for purposeful work, thinking big, and teamwork. The opportunities for impact here are endless as we build out both the UX practice and team in service of amazing experiences for our customers.&nbsp;</div><div><br></div><div>We're embedded on product teams so that we can be involved with projects from the get-go and work really closely with other disciplines at every stage of the process. Designers are an integral part of evolving and defining how Humi makes the world better for employers and employees.&nbsp;</div><div><br></div><div><b><span style=\"font-size: 24px\">What will you be doing as a Product Designer?</span></b></div><div>You’ll work closely with your product and engineering team members to ensure we’re solving the right problems and designing elegant solutions through an iterative, data-informed process.&nbsp; As a team member, you’ll contribute to creating the conditions for world-class work to be delivered every day.&nbsp;</div>","lists":[{"content":"<li>Participate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators&nbsp;</li><li>Build empathy through direct access to customers in sales and customer support calls&nbsp;</li><li>Be assigned to and get to know the problem space, product vision, and members of your product team</li><li>Work with your lead to build out a tailored goals and education plan in place to set you in the right direction for the upcoming quarter</li>","text":"In your first 30 days, you will:"},{"content":"<li>Work with a product manager to learn about more about a specific a problem space&nbsp;</li><li>Present your work and insights to stakeholders and team members many times</li><li>Participate in pair design sessions with other design team members</li><li>Contribute to the UX team’s culture, processes and practices</li>","text":"In your first 60 days, you will:"},{"content":"<li>Ship your first feature in partnership with your product and engineering counterparts</li><li>Have formed opinions on feature strategy and shared them with stakeholders</li><li>Participate in recruitment and onboarding activities for the UX team</li>","text":"In your first 90 days, you will: "},{"content":"<li>A keen eye for good design and attention to detail</li><li>A passion for solving core product problems while working through all facets of a user experience (strategy, IA, and interaction design)</li><li>Appreciation for the end to end iterative UX product design process, including researching user needs, user stories, journey mapping, content modeling, wireframing and prototyping, and testing</li><li>Experience collaborating with multiple disciplines including product and engineering, in pursuit of the best outcomes for customers</li><li>A deep empathy for the user, advocating for them, always</li><li>An interest in executing a data-informed approach to design</li><li>At least 3 years experience designing SaaS products</li>","text":"What are we looking for in a Product Designer?"}],"closing":"Let’s do this! We can’t wait to hear from you. \n","closingHtml":"<div><span style=\"font-size: 16px\">Let’s do this! We can’t wait to hear from you.&nbsp;</span></div>"},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3"],"reqCode":"","requisitionCodes":[],"urls":{"list":"https://jobs.lever.co/humi-2","show":"https://jobs.lever.co/humi-2/4dfc2029-053e-4559-a7d3-b3eee40348cf","apply":"https://jobs.lever.co/humi-2/4dfc2029-053e-4559-a7d3-b3eee40348cf/apply"},"confidentiality":"non-confidential","createdAt":1649365853588,"updatedAt":1650371242979},{"id":"6277e45e-66ab-40c9-b389-5ffaab6ce0cd","text":"Sr. Software Engineer, Ruby - Remote","state":"internal","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":"9c228554-7ba4-4834-888c-8196f8af3026","categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Software Engineering"},"tags":[],"content":{"description":"Our Engineering team keeps growing and we are looking for strong developers who have a passion for diving deep to build highly scalable and robust systems! All the while collaborating deeply with others on a kind, helpful and innovative team. As a key player on this team, you will be ready to deep dive into problems with the support of your team all the while weighing the cost and value in order to take the action that makes the most sense.\n\nAs a Senior Software Engineer on one of our Payroll software engineering squads, you will be an integral part of the engineering team. You will be facilitating the direction of projects with the team and stakeholders while driving creative solutions to our customer’s problems. If you have an aptitude for weighing in on tradeoffs between different technical approaches that could be taken then we want to hear from you!\n\nWhat will you do as a Senior Software Engineer, Ruby?\nFrom day one, you will be working in one of our cross-functional squads, specifically on the Payroll Product which is a Rails based API with some front end software engineers to support the front end. You will also be collaborating along with the rest of the team to deliver on new features and exciting initiatives.\n\nAs a senior within the team, you will help us scale, and mentor the junior members of the team. Your work will have a direct impact on building a world-class all-in-one HR platform.\n","descriptionHtml":"<div>Our Engineering team keeps growing and we are looking for strong developers who have a passion for diving deep to build highly scalable and robust systems! All the while collaborating deeply with others on a kind, helpful and innovative team. As a key player on this team, you will be ready to deep dive into problems with the support of your team all the while weighing the cost and value in order to take the action that makes the most sense.</div><div><br></div><div>As a Senior Software Engineer on one of our Payroll software engineering squads, you will be an integral part of the engineering team. You will be facilitating the direction of projects with the team and stakeholders while driving creative solutions to our customer’s problems. If you have an aptitude for weighing in on tradeoffs between different technical approaches that could be taken then we want to hear from you!</div><div><br></div><div><b><span style=\"font-size: 24px\">What will you do as a Senior Software Engineer, Ruby?</span></b></div><div>From day one, you will be working in one of our cross-functional squads, specifically on the Payroll Product which is a Rails based API with some front end software engineers to support the front end. You will also be collaborating along with the rest of the team to deliver on new features and exciting initiatives.</div><div><br></div><div>As a senior within the team, you will help us scale, and mentor the junior members of the team. Your work will have a direct impact on building a world-class all-in-one HR platform.</div>","lists":[{"content":"<li>Participate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators</li><li>Work with your manager to build out tailored goals and an education plan in place to set you in the right direction for the upcoming quarter</li><li>Deep dive into your squad's problem space and start becoming familiar with the many areas that compose payroll, like the tax engine, accounting software integrations, and the payroll core</li>","text":"In your first 30 days, you will focus on learning:"},{"content":"<li>Take full ownership of small features and quick wins within your squad, from scoping to implementation</li><li>Help more intermediate developers within code design and decision making</li><li>Contribute to the Engineering team's culture, processes, and best practices</li>","text":"In your first 60 days, you will focus on collaborating:"},{"content":"<li>Start assuming more autonomy and finding small ways to practice ownership across the platform</li><li>Work closely with your Manager to explore goals for the rest of the year</li><li>Deep dive on other parts of the application outside of the squad's main responsibilities</li>","text":"In your first 90 days, you will take initiative:"},{"content":"<li>Experience working with Ruby on Rails or similar frameworks like Django</li><li>Particularly interested in diving into technical debt and presenting a plan to tackle it</li><li>Is experienced in taking abstract business problems and driving collaboration between team members to find an optimal technical solution</li><li>Is curious about new technologies and presenting them to the group as they notice places where they can be beneficial</li><li>Excelled in cross-functional teams, working fluidly with Product Managers, Data Scientists, Software Developers, and other highly skilled specialists</li><li>Is particularly interested in building processes, tooling, and best practices for the team to help us mature as an engineering organization</li><li>Bonus: Experience working with Angular 2.0+, ReactJS or VueJs</li>","text":"What are we looking for in a Senior Software Engineer, Ruby?"},{"content":"<li>Fast-growing startup with competitive benefits and stock option plan</li><li>Dynamic and entrepreneurial team building the next generation of HR, payroll, benefits, and insurance platform</li><li>Additional health and wellness programs include a health spending account, virtual health through Akira, an employee assistance program with counseling and coaching through Inkblot</li><li>Open communication with management and company leadership</li><li>Small, dynamic teams = massive impact</li>","text":"Benefits"}],"closing":"Let’s do this! We can’t wait to hear from you\n","closingHtml":"<div><span style=\"font-size: 16px\">Let’s do this! We can’t wait to hear from you</span></div>"},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3","9c228554-7ba4-4834-888c-8196f8af3026"],"reqCode":"","requisitionCodes":[],"urls":{"list":"https://jobs.lever.co/humi-2","show":"https://jobs.lever.co/humi-2/6277e45e-66ab-40c9-b389-5ffaab6ce0cd","apply":"https://jobs.lever.co/humi-2/6277e45e-66ab-40c9-b389-5ffaab6ce0cd/apply"},"confidentiality":"non-confidential","createdAt":1649365698943,"updatedAt":1650552043862},{"id":"4b988793-08ea-4e73-a8e4-cb0823de2a42","text":"Senior TypeScript Software Engineer - Remote","state":"internal","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Software Engineering"},"tags":[],"content":{"description":"Are you ready to innovate? This past year has given us a renewed perspective on how we approach work, the impact of remote work, and as result has highlighted the impact of reliable and scalable HR and payroll software. \nWe are changing it up on the front end from Angular to the oh-so-fun language of React. We are looking for front-end gurus to help us with this major transformation. \n\nOur Engineering team is growing and we are looking for strong developers who have a passion for building highly scalable and robust systems. As a Senior TypeScript Software Engineer in our Platform squad, you will be an integral part of the engineering team, and be in a position to help introduce new frameworks, tools, and architecture to build capacity within the platform as we scale and empower product Software Engineers to have a better experience when building and shipping new features. \n\nWhat will you do as a Senior TypeScript Software Engineer?\nFrom day one, you will be working in one of our most impactful teams; and collaborating along with the rest of the team to deliver on new capabilities, tooling, and exciting initiatives.\n\nAs a senior within the engineering organization, you will help us scale, and mentor the junior members of the frontend team. Your work will have a direct impact on building a world-class all-in-one HR platform.\n","descriptionHtml":"<div>Are you ready to innovate? This past year has given us a renewed perspective on how we approach work, the impact of remote work, and as result has highlighted the impact of reliable and scalable HR and payroll software.&nbsp;</div><div>We are changing it up on the front end from Angular to the oh-so-fun language of React. We are looking for front-end gurus to help us with this major transformation.&nbsp;</div><div><br></div><div>Our Engineering team is growing and we are looking for strong developers who have a passion for building highly scalable and robust systems. As a Senior TypeScript Software Engineer&nbsp;in our Platform squad, you will be an integral part of the engineering team, and be in a position to help introduce new frameworks, tools,&nbsp;and architecture to build capacity within the platform as we scale and empower product Software Engineers to have a better experience when building and shipping new features.&nbsp;</div><div><br></div><div><b style=\"font-size: 24px\">What will you do as a Senior TypeScript Software Engineer?</b></div><div>From day one, you will be working in one of our most impactful teams; and collaborating along with the rest of the team to deliver on new capabilities, tooling, and exciting initiatives.</div><div><br></div><div>As a senior within the engineering organization, you will help us scale, and mentor the junior members of the frontend team. Your work will have a direct impact on building a world-class all-in-one HR platform.</div>","lists":[{"content":"<li>Participate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators</li><li>Work with your manager to build out tailored goals and an education plan in place to set you in the right direction for the upcoming quarter</li><li>Deep dive on your squad's problem space and start becoming familiar with the many areas that compose the Humi product</li>","text":"In your first 30 days, you will focus on learning:"},{"content":"<li>Take full ownership of new capabilities and tooling within the Platform product roadmap</li><li>Help more intermediate developers within code design and decision making</li><li>Contribute to the Engineering team's culture, processes, and best practices</li>","text":"In your first 60 days, you will focus on collaborating:"},{"content":"<li>Start assuming more autonomy and finding small ways to practice ownership across the platform</li><li>Work closely with your Manager to explore goals for the rest of the year</li><li>Deep dive on other parts of the application outside of the squad's main responsibilities</li>","text":"In your first 90 days, you will take initiative:"},{"content":"<li>+4 years of industry experience working with React or similiar front end libraries (VueJS)</li><li>Industry experience working with TypeScript and JavaScript</li><li>Deep experience with a modern web stack, whether it's JavaScript bundlers, React internals, etc.</li><li>Passion for developing scalable, well-designed software that people love</li><li>Excellent communication skills: you must be able to collaborate effectively with teams in a fully-remote environment and discuss complex topics with technical and non-technical audiences</li><li>A desire to help our team continuously improve</li>","text":"What are we looking for in a Senior TypeScript Software Engineer?"},{"content":"<li>Fast-growing startup with competitive benefits and stock option plan</li><li>Dynamic and entrepreneurial team building the next generation of HR, payroll, benefits, and insurance platform</li><li>Additional health and wellness programs include a health spending account, virtual health through Telus Health, an employee assistance program with counseling and coaching through Inkblot</li><li>Open communication with management and company leadership</li><li>Small, dynamic teams = massive impact</li>","text":"Benefits"}],"closing":"Let’s do this! We can’t wait to hear from you.\n","closingHtml":"<div><span style=\"font-size: 16px\">Let’s do this! We can’t wait to hear from you.</span></div>"},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3"],"reqCode":"","requisitionCodes":[],"urls":{"list":"https://jobs.lever.co/humi-2","show":"https://jobs.lever.co/humi-2/4b988793-08ea-4e73-a8e4-cb0823de2a42","apply":"https://jobs.lever.co/humi-2/4b988793-08ea-4e73-a8e4-cb0823de2a42/apply"},"confidentiality":"non-confidential","createdAt":1649365436272,"updatedAt":1650482582236},{"id":"c2d8cbc8-caee-4d75-9855-8d2e9201cc4c","text":"Full Stack Developer, PHP - Remote","state":"internal","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Software Engineering"},"tags":[],"content":{"description":"Are you ready to innovate? This past year has given us a renewed perspective on how we approach work, the impact of remote work and as result has highlighted the impact of reliable and scalable HR and payroll software.\n\nOur Engineering team is growing and we are looking for strong developers who have a passion for building highly scalable and robust systems. As a Developer in one of our HR software engineering squads, you will be an integral part of the engineering team, and be in a position to deliver value to our customers by shipping new features and helping our platform scale.\n\nWhat will you do as a Full Stack Developer?\nFrom day one, you will be working in one of our cross-functional squads; and collaborating along with the rest of the team to deliver on new features and exciting initiatives.\n\nAs a Developer within the team, you will help us scale, and mentor the junior members of the team. Your work will have a direct impact on building a world-class all-in-one HR platform.\n","descriptionHtml":"<div>Are you ready to innovate? This past year has given us a renewed perspective on how we approach work, the impact of remote work and as result has highlighted the impact of reliable and scalable HR and payroll software.</div><div><br></div><div>Our Engineering team is growing and we are looking for strong developers who have a passion for building highly scalable and robust systems. As a Developer in one of our HR software engineering squads, you will be an integral part of the engineering team, and be in a position to deliver value to our customers by shipping new features and helping our platform scale.</div><div><br></div><div><b style=\"font-size: 24px\">What will you do as a Full Stack Developer?</b></div><div>From day one, you will be working in one of our cross-functional squads; and collaborating along with the rest of the team to deliver on new features and exciting initiatives.</div><div><br></div><div>As a Developer within the team, you will help us scale, and mentor the junior members of the team. Your work will have a direct impact on building a world-class all-in-one HR platform.</div>","lists":[{"content":"<li>Participate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators</li><li>Work with your manager to build out tailored goals and an education plan in place to set you in the right direction for the upcoming quarter</li><li>Deep dive on your squad's problem space and start becoming familiar with the many areas that compose HR, like Time Off, Document Signing, and Recruiting</li>","text":"In your first 30 days, you will focus on learning:"},{"content":"<li>Take full ownership of small features and quick wins within your squad, from scoping to implementation</li><li>Help more intermediate developers within code design and decision making</li><li>Contribute to the Engineering team's culture, processes, and best practices</li>","text":"In your first 60 days, you will focus on collaborating:"},{"content":"<li>Start assuming more autonomy and finding small ways to practice ownership across the platform</li><li>Work closely with your Manager to explore goals for the rest of the year</li><li>Deep dive on other parts of the application outside of the squad's main responsibilities</li>","text":"In your first 90 days, you will take initiative:"},{"content":"<li>Ample experience working with Laravel or similar PHP frameworks</li><li>Experience working with Angular 2.0+ or similar modern frameworks like ReactJS or VueJs</li><li>A passion for building engaging user experiences</li><li>Thrived in web application development with Laravel or similar</li><li>The ability to bring best practices, techniques, and technologies to the table</li><li>Excelled in cross-functional teams, working fluidly with Product Managers, Data Scientists, Software Developers, and other highly skilled specialists</li><li>A passionate focus on quality, writing testable code that performs well for our consumers</li><li>A desire to help our team continuously improve</li>","text":"What are we looking for in a Full Stack Developer?"},{"content":"<li>Fast-growing startup with competitive benefits and stock option plan</li><li>Dynamic and entrepreneurial team building the next generation of HR, payroll, benefits, and insurance platform</li><li>Additional health and wellness programs include a health spending account, virtual health through Akira, an employee assistance program with counseling and coaching through Inkblot</li><li>Open communication with management and company leadership</li><li>Small, dynamic teams = massive impact</li>","text":"Benefits"}],"closing":"Let’s do this! We can’t wait to hear from you.\n","closingHtml":"<div><span style=\"font-size: 16px\">Let’s do this! We can’t wait to hear from you.</span></div>"},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3"],"reqCode":"","requisitionCodes":[],"urls":{"list":"https://jobs.lever.co/humi-2","show":"https://jobs.lever.co/humi-2/c2d8cbc8-caee-4d75-9855-8d2e9201cc4c","apply":"https://jobs.lever.co/humi-2/c2d8cbc8-caee-4d75-9855-8d2e9201cc4c/apply"},"confidentiality":"non-confidential","createdAt":1649365118192,"updatedAt":1650371270294},{"id":"45d4faa5-81e6-446d-8497-a4447fd0e8bd","text":"Senior Front End Software Engineer - Remote","state":"internal","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":"5a178705-70cb-45ec-ab2f-6f88cc0beba9","categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Software Engineering"},"tags":[],"content":{"description":"What will you do as a Senior Front End Software Engineer?\nFrom day one, you will be working in one of our cross-functional squads; and collaborating along with the rest of the team to deliver on new features and exciting initiatives.\n\nAs a senior within the team, you will help us scale, and mentor the junior members of the team. Your work will have a direct impact on building a world-class all-in-one HR platform.\n\n","descriptionHtml":"<div><b style=\"font-size: 18px\">What will you do as a Senior Front End Software Engineer?</b></div><div>From day one, you will be working in one of our cross-functional squads; and collaborating along with the rest of the team to deliver on new features and exciting initiatives.</div><div><br></div><div>As a senior within the team, you will help us scale, and mentor the junior members of the team. Your work will have a direct impact on building a world-class all-in-one HR platform.</div><div><br></div>","lists":[{"content":"<li>Participate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators</li><li>Work with your manager to build out tailored goals and an education plan in place to set you in the right direction for the upcoming quarter</li><li>Deep dive on your squad's problem space and start becoming familiar with the many areas that compose HR, like Time Off, Document Signing, and Recruiting</li>","text":"In your first 30 days, you will focus on learning:"},{"content":"<li>Take full ownership of small features and quick wins within your squad, from scoping to implementation</li><li>Help more intermediate developers within code design and decision making</li><li>Contribute to the Engineering team's culture, processes, and best practices</li>","text":"In your first 60 days, you will focus on collaborating:"},{"content":"<li>Start assuming more autonomy and finding small ways to practice ownership across the platform</li><li>Work closely with your Manager to explore goals for the rest of the year</li><li>Deep dive on other parts of the application outside of the squad's main responsibilities</li>","text":"In your first 90 days, you will take initiative:"},{"content":"<li>+4 years of experience working with React and/or React Native engineer&nbsp;</li><li>Experience with JavaScript/TypeScript, MongoDB, Firebase, Jest</li><li>A passion for building engaging user experiences</li><li>Strong expertise with database technologies</li><li>The ability to bring leading industry techniques and technologies to the table</li><li>Excelled in cross-functional teams, working fluidly with Product Managers, Data Scientists, Software Developers, and other highly skilled specialists</li><li>A passionate focus on quality, writing testable code that performs well for our consumers</li><li>A desire to help our team continuously improve</li>","text":"What are we looking for in a Senior Front End Software Engineer?"},{"content":"<li>Fast-growing startup with competitive benefits and stock option plan</li><li>Dynamic and entrepreneurial team building the next generation of HR, payroll, benefits, and insurance platform</li><li>Additional health and wellness programs include a health spending account, virtual health through Akira, an employee assistance program with counseling and coaching through Inkblot</li><li>Open communication with management and company leadership</li><li>Small, dynamic teams = massive impact</li>","text":"Benefits"}],"closing":"Let’s do this! We can’t wait to hear from you.\n","closingHtml":"<div>Let’s do this! We can’t wait to hear from you.</div>"},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3","5a178705-70cb-45ec-ab2f-6f88cc0beba9"],"reqCode":"","requisitionCodes":[],"urls":{"list":"https://jobs.lever.co/humi-2","show":"https://jobs.lever.co/humi-2/45d4faa5-81e6-446d-8497-a4447fd0e8bd","apply":"https://jobs.lever.co/humi-2/45d4faa5-81e6-446d-8497-a4447fd0e8bd/apply"},"confidentiality":"non-confidential","createdAt":1647906898352,"updatedAt":1650371922026},{"id":"a3c4628d-607c-4eb7-a761-7705aa866122","text":"Business Development Representative - Remote","state":"closed","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":"a16c7ca7-d821-4b45-bec2-ff4947134373","categories":{"commitment":"Full Time","department":null,"level":null,"location":"Canada","team":"Sales"},"tags":[],"content":{"description":"What will you be doing as a Business Development Representative?\nYou’ll be responsible for prospecting and qualifying new leads. Your main goal is to set up demos for our Account Executives and build strong relationships with Canadian small and medium sized businesses (SMBs), from law firms to startups, restaurants to colleges.\n","descriptionHtml":"<div><b>What will you be doing as a Business Development Representative?</b></div><div>You’ll be responsible for prospecting and qualifying new leads. Your main goal is to set up demos for our Account Executives and build strong relationships with Canadian small and medium sized businesses (SMBs), from law firms to startups, restaurants to colleges.</div>","lists":[{"content":"<li>Drive Humi’s revenue growth through outreach emails &amp; phone-calls with a focus on setting demo appointments for the sales team</li><li>Research prospect contact information and best ways to get in touch with them - let your creativity fly with songs, dances, poems and more&nbsp;</li><li>Work closely with your teammates and leadership to come up with new, better ways of doing things</li><li>Nurture and qualify new leads that turn into quality demo appointments</li><li>Educate prospects on Humi’s HR, payroll, and benefits solutions</li><li>Work closely with Sales &amp; Marketing on various projects that are in support of the entire BDR team. Want to know more? Check out this&nbsp;<a href=\"https://www.saleshacker.com/day-life-sales-development-rep/\" class=\"postings-link\">guide.</a>&nbsp;</li>","text":"If you’re dying to break into the world of fast growing startups and ready to grow your career in sales, we would love to speak with you! In this role you will:"},{"content":"<li>Meet the co-founders and learn about Humi’s history and future (it’s a very bright looking future!)&nbsp;</li><li>Receive access and training to your sales tools: Hubspot, Salesloft, Zoominfo</li><li>Receive product training on all our modules: HR, payroll, and benefits</li><li>Learn about why thousands of companies have chosen Humi and the benefits we deliver daily to them</li><li>Learn how SaaS sales work - recieve an in-depth education on how sales works (it’s much more methodical and strategic than you think! Charisma has nothing to do with it)</li><li>Start to prospect - you’ll send your first email and make your first phone call before the end of your first week</li>","text":"In your first 30 days, you will:"},{"content":"<li>Be comfortable working independently while still receiving daily feedback</li><li>Start to understand the nuance of matching different value propositions to different personas</li><li>Have a clear understanding of the expectations in your role and how to achieve them, including hitting your weekly activity metric</li><li>Start implementing your own ideas</li>","text":"In your first 60 days, you will:"},{"content":"<li>Create a career and goals plan&nbsp;</li><li>Begin making modifications to pitches and talk tracks based on data</li><li>Continue your education around Humi’s competitive advantage and continue to strengthen your business acumen</li><li>Consistently achieve your activity goals and begin hitting your sales targets</li><li>Become an expert on internal tools and processes</li>","text":"In your first 90 days, you will:"},{"content":"<li>Have a strong history of hitting quota</li><li>Shown leadership as the team grows</li><li>Be positioned to either move into a Jr. Account Executive role and start closing your own deals or take on more leadership responsibilities in the BDR team</li>","text":"In your first year, you will:"},{"content":"<li>Must be a team player and highly self-motivated, with endless empathy</li><li>Excellent at being adaptable to change and switching priorities</li><li>Proven ability to sell with a minimum 1 year of experience in the service industry, field sales, door to door, retail or in a professional capacity&nbsp;</li><li>The ability to deal with and thrive on objections and rejection daily</li><li>Proficient in conducting detailed data analyses and using metrics to drive business results</li><li>Very strong verbal and written communication skills</li><li>Not scared of picking up the phone and talking to strangers</li><li>Desire to move up the ranks and become an Account Executive or team leader in the future required&nbsp;</li>","text":"What are we looking for in a Business Development Representative?"}],"closing":"","closingHtml":""},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3","a16c7ca7-d821-4b45-bec2-ff4947134373"],"reqCode":"","requisitionCodes":[],"urls":null,"confidentiality":"non-confidential","createdAt":1647906650610,"updatedAt":1650371172323},{"id":"d689f7b2-6adf-4ac7-8236-0a4da7e568d5","text":"Product Designer","state":"closed","distributionChannels":null,"user":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","owner":"889ddef9-da89-4479-98d1-0ba1b9d2aab3","hiringManager":"5a178705-70cb-45ec-ab2f-6f88cc0beba9","categories":{"commitment":"Full Time","department":null,"level":null,"location":"Toronto, Ontario","team":"User Experience (UX)"},"tags":[],"content":{"description":"What will you be doing as a Product Designer?\nYou’ll work closely with your product and engineering team members to ensure we’re solving the right problems and designing elegant solutions through an iterative, data-informed process.  As a team member, you’ll contribute to creating the conditions for world-class work to be delivered every day. \n\nIn your first 30 days, you will:\nParticipate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators \nBuild empathy through direct access to customers in sales and customer support calls \nBe assigned to and get to know the problem space, product vision, and members of your product team\nWork with your lead to build out a tailored goals and education plan in place to set you in the right direction for the upcoming quarter\n\nIn your first 60 days, you will:\nWork with a product manager to learn about more about a specific a problem space \nPresent your work and insights to stakeholders and team members many times\nParticipate in pair design sessions with other design team members\nContribute to the UX team’s culture, processes and practices\n\nIn your first 90 days, you will: \nShip your first feature in partnership with your product and engineering counterparts\nHave formed opinions on feature strategy and shared them with stakeholders\nParticipate in recruitment and onboarding activities for the UX team\n\nWhat are we looking for in a Product Designer?\nA keen eye for good design and attention to detail\nA passion for solving core product problems while working through all facets of a user experience (strategy, IA, and interaction design)\nAppreciation for the end to end iterative UX product design process, including researching user needs, user stories, journey mapping, content modeling, wireframing and prototyping, and testing\nExperience collaborating with multiple disciplines including product and engineering, in pursuit of the best outcomes for customers\nA deep empathy for the user, advocating for them, always\nAn interest in executing a data-informed approach to design\nAt least 3 years experience designing SaaS products\n\nLet’s do this! We can’t wait to hear from you. \n","descriptionHtml":"<div><b>What will you be doing as a Product Designer?</b></div><div>You’ll work closely with your product and engineering team members to ensure we’re solving the right problems and designing elegant solutions through an iterative, data-informed process.&nbsp; As a team member, you’ll contribute to creating the conditions for world-class work to be delivered every day.&nbsp;</div><div><br></div><div><b>In your first 30 days, you will:</b></div><div>Participate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators&nbsp;</div><div>Build empathy through direct access to customers in sales and customer support calls&nbsp;</div><div>Be assigned to and get to know the problem space, product vision, and members of your product team</div><div>Work with your lead to build out a tailored goals and education plan in place to set you in the right direction for the upcoming quarter</div><div><br></div><div><b>In your first 60 days, you will:</b></div><div>Work with a product manager to learn about more about a specific a problem space&nbsp;</div><div>Present your work and insights to stakeholders and team members many times</div><div>Participate in pair design sessions with other design team members</div><div>Contribute to the UX team’s culture, processes and practices</div><div><br></div><div><b>In your first 90 days, you will:&nbsp;</b></div><div>Ship your first feature in partnership with your product and engineering counterparts</div><div>Have formed opinions on feature strategy and shared them with stakeholders</div><div>Participate in recruitment and onboarding activities for the UX team</div><div><br></div><div><b>What are we looking for in a Product Designer?</b></div><div>A keen eye for good design and attention to detail</div><div>A passion for solving core product problems while working through all facets of a user experience (strategy, IA, and interaction design)</div><div>Appreciation for the end to end iterative UX product design process, including researching user needs, user stories, journey mapping, content modeling, wireframing and prototyping, and testing</div><div>Experience collaborating with multiple disciplines including product and engineering, in pursuit of the best outcomes for customers</div><div>A deep empathy for the user, advocating for them, always</div><div>An interest in executing a data-informed approach to design</div><div>At least 3 years experience designing SaaS products</div><div><br></div><div>Let’s do this! We can’t wait to hear from you.&nbsp;</div>","lists":[{"content":"<li><br></li>","text":""}],"closing":"","closingHtml":""},"followers":["889ddef9-da89-4479-98d1-0ba1b9d2aab3","5a178705-70cb-45ec-ab2f-6f88cc0beba9"],"reqCode":"","requisitionCodes":[],"urls":null,"confidentiality":"non-confidential","createdAt":1647906229247,"updatedAt":1650371941994},{"id":"f8b1d336-a67e-4fc4-ad9f-ba5c64d9c431","text":"Product Designer","state":"draft","distributionChannels":null,"user":"5a178705-70cb-45ec-ab2f-6f88cc0beba9","owner":"5a178705-70cb-45ec-ab2f-6f88cc0beba9","hiringManager":null,"categories":{"commitment":"Full Time","department":null,"level":null,"location":"Vancouver, British Columbia","team":"User Experience (UX)"},"tags":[],"content":{"description":"Are you ready to make a change? This year has given us all the opportunity to reevaluate how we’re growing our careers and if we’re having the impact we want on the world while doing so.\n\nThis Intermediate role sits at the heart of both those missions. Our UX team is just getting started on growing and we are looking for strong team members who have a passion for purposeful work, thinking big, and teamwork. The opportunities for impact here are endless as we build out both the UX practice and team in service of amazing experiences for our customers. \n\nWe're embedded on product teams so that we can be involved with projects from the get-go and work really closely with other disciplines at every stage of the process. Designers are an integral part of evolving and defining how Humi makes the world better for employers and employees. \n\nWhat will you be doing as a Product Designer?\nYou’ll work closely with your product and engineering team members to ensure we’re solving the right problems and designing elegant solutions through an iterative, data-informed process.  As a team member, you’ll contribute to creating the conditions for world-class work to be delivered every day. \nIn your first 30 days, you will:\nParticipate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators \nBuild empathy through direct access to customers in sales and customer support calls \nBe assigned to and get to know the problem space, product vision, and members of your product team\nWork with your lead to build out a tailored goals and education plan in place to set you in the right direction for the upcoming quarter\nIn your first 60 days, you will:\nWork with a product manager to learn about more about a specific a problem space \nPresent your work and insights to stakeholders and team members many times\nParticipate in pair design sessions with other design team members\nContribute to the UX team’s culture, processes and practices\nIn your first 90 days, you will: \nShip your first feature in partnership with your product and engineering counterparts\nHave formed opinions on feature strategy and shared them with stakeholders\nParticipate in recruitment and onboarding activities for the UX team\n\nWhat are we looking for in a Product Designer?\nA keen eye for good design and attention to detail\nA passion for solving core product problems while working through all facets of a user experience (strategy, IA, and interaction design)\nAppreciation for the end to end iterative UX product design process, including researching user needs, user stories, journey mapping, content modeling, wireframing and prototyping, and testing\nExperience collaborating with multiple disciplines including product and engineering, in pursuit of the best outcomes for customers\nA deep empathy for the user, advocating for them, always\nAn interest in executing a data-informed approach to design\nAt least 3 years experience designing SaaS products\n\nLet’s do this! We can’t wait to hear from you. \n","descriptionHtml":"<div>Are you ready to make a change? This year has given us all the opportunity to reevaluate how we’re growing our careers and if we’re having the impact we want on the world while doing so.</div><div><br></div><div>This Intermediate role sits at the heart of both those missions. Our UX team is just getting started on growing and we are looking for strong team members who have a passion for purposeful work, thinking big, and teamwork. The opportunities for impact here are endless as we build out both the UX practice and team in service of amazing experiences for our customers.&nbsp;</div><div><br></div><div>We're embedded on product teams so that we can be involved with projects from the get-go and work really closely with other disciplines at every stage of the process. Designers are an integral part of evolving and defining how Humi makes the world better for employers and employees.&nbsp;</div><div><br></div><div><b>What will you be doing as a Product Designer?</b></div><div>You’ll work closely with your product and engineering team members to ensure we’re solving the right problems and designing elegant solutions through an iterative, data-informed process.&nbsp; As a team member, you’ll contribute to creating the conditions for world-class work to be delivered every day.&nbsp;</div><div>In your first 30 days, you will:</div><div>Participate in Humi’s immersive onboarding program to learn about all aspects of the business while meeting with cross-functional collaborators&nbsp;</div><div>Build empathy through direct access to customers in sales and customer support calls&nbsp;</div><div>Be assigned to and get to know the problem space, product vision, and members of your product team</div><div>Work with your lead to build out a tailored goals and education plan in place to set you in the right direction for the upcoming quarter</div><div>In your first 60 days, you will:</div><div>Work with a product manager to learn about more about a specific a problem space&nbsp;</div><div>Present your work and insights to stakeholders and team members many times</div><div>Participate in pair design sessions with other design team members</div><div>Contribute to the UX team’s culture, processes and practices</div><div>In your first 90 days, you will:&nbsp;</div><div>Ship your first feature in partnership with your product and engineering counterparts</div><div>Have formed opinions on feature strategy and shared them with stakeholders</div><div>Participate in recruitment and onboarding activities for the UX team</div><div><br></div><div><b>What are we looking for in a Product Designer?</b></div><div>A keen eye for good design and attention to detail</div><div>A passion for solving core product problems while working through all facets of a user experience (strategy, IA, and interaction design)</div><div>Appreciation for the end to end iterative UX product design process, including researching user needs, user stories, journey mapping, content modeling, wireframing and prototyping, and testing</div><div>Experience collaborating with multiple disciplines including product and engineering, in pursuit of the best outcomes for customers</div><div>A deep empathy for the user, advocating for them, always</div><div>An interest in executing a data-informed approach to design</div><div>At least 3 years experience designing SaaS products</div><div><br></div><div>Let’s do this! We can’t wait to hear from you.&nbsp;</div>","lists":[],"closing":"","closingHtml":""},"followers":["5a178705-70cb-45ec-ab2f-6f88cc0beba9"],"reqCode":null,"requisitionCodes":[],"urls":null,"confidentiality":"non-confidential","createdAt":1647446382319,"updatedAt":1647446382319}],"hasNext":false}